in this router-
Router(config)#int gig0/0/0
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#int gig0/0/1
Router(config-if)#ip nat outside
Router(config-if)#exit
Router(config)#ip nat inside source static 192.168.1.1 11.0.0.3
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#show ip nat translations
Pro  Inside global     Inside local       Outside local      Outside global
---  11.0.0.3          192.168.1.1        ---                ---

Router#
 in this router-
Router>enable
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gig0/0/0
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#int gig0/0/1
Router(config-if)#ip nat outside
Router(config-if)#exit
Router(config)#access-list 10 permit 192.168.1.0 0.0.0.255
Router(config)#access-list 10 deny any
Router(config)#ip nat pool ITER 11.0.0.3 11.0.0.7 netmask 255.0.0.0
Router(config)#ip nat inside source list 10 pool ITER
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show ip nat translation
Pro  Inside global     Inside local       Outside local      Outside global
icmp 11.0.0.3:3        192.168.1.1:3      192.168.2.1:3      192.168.2.1:3
icmp 11.0.0.3:4        192.168.1.1:4      192.168.2.1:4      192.168.2.1:4
icmp 11.0.0.3:5        192.168.1.1:5      192.168.2.1:5      192.168.2.1:5
---  11.0.0.3          192.168.1.1        ---                ---

Router#in this router-
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gig0/0/0
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#int gig0/0/1
Router(config-if)#ip nat outside
Router(config-if)#exit
Router(config)#access-list 10 permit 192.168.1.0 0.0.0.255
Router(config)#access-list 10 deny any
Router(config)#ip nat inside source list 10 int gig0/0/1 overload
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show ip nat translation
Pro  Inside global     Inside local       Outside local      Outside global
icmp 11.0.0.1:1        192.168.1.2:1      192.168.2.1:1      192.168.2.1:1
icmp 11.0.0.1:2        192.168.1.2:2      192.168.2.1:2      192.168.2.1:2
icmp 11.0.0.3:6        192.168.1.1:6      192.168.2.1:6      192.168.2.1:6
icmp 11.0.0.3:7        192.168.1.1:7      192.168.2.1:7      192.168.2.1:7
icmp 11.0.0.3:8        192.168.1.1:8      192.168.2.1:8      192.168.2.1:8
---  11.0.0.3          192.168.1.1        ---                ---

Router#